In [ ]:
CSV (comma separated value)
file extension
#pandas - package
#data frame - pandas data type

In [1]:
file = open('data.csv','x')
file.close()

In [ ]:
#pip install pandas

In [6]:
import pandas as pd      #read garna
df = pd.read_csv('data.csv')
df

   sn    name  age    address       phone
0   1  rojina   23  kalyanpur  9821888560
1   2   paras   23       tadi  9845120250
2   3    riya   19  mangalpur  9876543210
3   4  bimala   43  kalyanpur  9845271769
4   5  ganesh   50  kalyanpur  9845138429
5   6  suchak   19      parsa  9807865432

In [7]:
#to read row
import pandas as pd      
df = pd.read_csv('data.csv',nrows = 5)
df

   sn    name  age    address       phone
0   1  rojina   23  kalyanpur  9821888560
1   2   paras   23       tadi  9845120250
2   3    riya   19  mangalpur  9876543210
3   4  bimala   43  kalyanpur  9845271769
4   5  ganesh   50  kalyanpur  9845138429

In [8]:
#to read rows another step
import pandas as pd
df = pd.read_csv('data.csv')
df.head()   #head le default rup ma 5 ota matrai garcha value

   sn    name  age    address       phone
0   1  rojina   23  kalyanpur  9821888560
1   2   paras   23       tadi  9845120250
2   3    riya   19  mangalpur  9876543210
3   4  bimala   43  kalyanpur  9845271769
4   5  ganesh   50  kalyanpur  9845138429

In [9]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df.head()
#df.tail()   data ko sample herya

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560
2    paras   23       tadi  9845120250
3     riya   19  mangalpur  9876543210
4   bimala   43  kalyanpur  9845271769
5   ganesh   50  kalyanpur  9845138429

In [10]:
#can choice which column to use                  #cols = variable
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn',usecols = ['sn','name','phone'])
df.head()

      name       phone
sn
1   rojina  9821888560
2    paras  9845120250
3     riya  9876543210
4   bimala  9845271769
5   ganesh  9845138429

In [3]:
#to select row using iloc 
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn',usecols = ['sn','name','phone'])
df.iloc[1:4]  # index = 1,2,3

      name       phone
sn
2    paras  9845120250
3     riya  9876543210
4   bimala  9845271769

In [2]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df.iloc[1:4,0:3]

      name  age    address
sn
2    paras   23       tadi
3     riya   19  mangalpur
4   bimala   43  kalyanpur

In [4]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560
2    paras   23       tadi  9845120250
3     riya   19  mangalpur  9876543210
4   bimala   43  kalyanpur  9845271769
5   ganesh   50  kalyanpur  9845138429
6   suchak   19      parsa  9807865432

In [6]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df.loc[1:3]

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560
2    paras   23       tadi  9845120250
3     riya   19  mangalpur  9876543210

In [7]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'name')
df     #index_col jaslai bhanauna value unique huncha ra yo value anushar reference ligcha

        sn  age    address       phone
name
rojina   1   23  kalyanpur  9821888560
paras    2   23       tadi  9845120250
riya     3   19  mangalpur  9876543210
bimala   4   43  kalyanpur  9845271769
ganesh   5   50  kalyanpur  9845138429
suchak   6   19      parsa  9807865432

In [8]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['rojina':'riya']

        sn  age    address       phone
name
rojina   1   23  kalyanpur  9821888560
paras    2   23       tadi  9845120250
riya     3   19  mangalpur  9876543210

In [9]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['name']

sn
1    rojina
2     paras
3      riya
4    bimala
5    ganesh
6    suchak
Name: name, dtype: object

In [10]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df['name'] ==  'rojina' # == comparison operator

sn
1     True
2    False
3    False
4    False
5    False
6    False
Name: name, dtype: bool

In [11]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['name'] ==  'rojina']   # double df means j value aaucha, df ma convert gara

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560

In [12]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['age'] > 20]

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560
2    paras   23       tadi  9845120250
4   bimala   43  kalyanpur  9845271769
5   ganesh   50  kalyanpur  9845138429

In [13]:
df['age']

sn
1    23
2    23
3    19
4    43
5    50
6    19
Name: age, dtype: int64

In [14]:
list(df['age'])

[23, 23, 19, 43, 50, 19]

In [15]:
list(df['age'])[0]

23

In [16]:
type(list(df['age'])[0])

int

In [1]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
data = df[df['age']>20]
data.to_csv('new_data.csv')    #to_csv  afai create garcha file and write garcha

In [4]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'sn')
data = df[(df['age']>20) & (df['address'] =='kalyanpur')]
data

      name  age    address       phone
sn
1   rojina   23  kalyanpur  9821888560
4   bimala   43  kalyanpur  9845271769
5   ganesh   50  kalyanpur  9845138429

In [3]:
import pandas as pd
d = {'sn':[1,2],
    'product':['momo','coke'],
    'price':[200,100],
    'quantity':[2,4],
    'total':[400,400]}
df= pd.DataFrame(d)
df

   sn product  price  quantity  total
0   1    momo    200         2    400
1   2    coke    100         4    400

In [1]:
#list ma write kasari garne
import csv
data = [[1,'momo',200,2,400],
        [2,'coke',100,4,400]]
with open('bills.csv','w') as file:
    x = csv.writer(file)   # x = object (hold operation)
    x.writerows(data)

In [ ]:
#DictReader
-pandas or csv ma bhayeko data haru huncha teslai dictionary ko format ma read garne

In [1]:
import csv
with open('data.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'sn': '1', 'name': 'rojina', 'age': '23', 'address': 'kalyanpur', 'phone': '9821888560'}
{'sn': '2', 'name': 'paras', 'age': '23', 'address': 'tadi', 'phone': '9845120250'}
{'sn': '3', 'name': 'riya', 'age': '19', 'address': 'mangalpur', 'phone': '9876543210'}
{'sn': '4', 'name': 'bimala', 'age': '43', 'address': 'kalyanpur', 'phone': '9845271769'}
{'sn': '5', 'name': 'ganesh', 'age': '50', 'address': 'kalyanpur', 'phone': '9845138429'}
{'sn': '6', 'name': 'suchak', 'age': '19', 'address': 'parsa', 'phone': '9807865432'}

In [3]:
#DictWriter
import csv
csv_columns = ['Name','Age','Address']
dict = [
    {'Name':'Rojina','Age':23,'Address':'Bharatpur'},
    {'Name':'Paras','Age':23,'Address':'Tadi'}
    
]

with open('data.csv','w') as csvfile:
    writer = csv.DictWriter(csvfile,fieldnames =csv_columns)
    writer.writeheader()
    for data in dict:
        writer.writerow(data)